//На вход программе через стандартный ввод передаются два целых числа, по модулю не превышающие 100000. Выведите в стандартный вывод их сумму.
//
//stdin		stdout
//2 3		5
//- 4 - 9   - 13
//- 1 2		1
//
//Подсказки
//Ваша программа должна выводить в cout только одно число — сумму введённых чисел(т.е.не надо выводить в cout входные числа или строки типа "A = ")
//Вам не надо проверять, что входные числа не превышают по модулю 100000. Мы гарантируем, что в тестирующей системе вашей программе будут подаваться только числа, удовлетворяющие указанным ограничениям

#include <iostream>
using namespace std;

int main() {
	int x = 0, y = 0;
	cin >> x >> y;
	cout << x + y;
	return 0;
}